# The REPL
LISPs all have a so-called Read-Eval-Print-Loop where you type an expression and the interpreter responds by displaying the result of its evaluating that expression.

## Try Clojure
You can use [Try Clojure](http://www.tryclj.com/) to get a REPL (you may also like to do the intro there, start it by typing `next`)

## Leiningen
Leiningen is the easiest way to manage Clojure projects, it also provides a repl

Run `lein repl` from the commandline after you have [installed Leiningen](http://leiningen.org/)


# Primitive expressions

## Self-evaluating expressions
Some things simply evaluate to themselves:

### Numbers
```clojure
> 3
3
```

### Strings
```clojure
> "Hello"
"Hello"
```

### Keywords
```clojure
> :foo
:foo
```

### Booleans
```clojure
> true
true

> false
false
```

### Chars
```clojure
> \c
\c
```

### Unbound variables
If you try to lookup a name that does not exist then you get an error

```clojure
> undefined
CompilerException java.lang.RuntimeException:
  Unable to resolve symbol: undefined in this context
```

# Compound elements
```clojure
    > (+ 2 4)
    6
```

Expressions such as these, formed by delimiting a list of expressions within parentheses in order to denote procedure application, are called *combinations*. The leftmost element in the list is called the *operator*, and the other elements are called *operands*. The value of a combination is obtained by applying the procedure specified by the operator to the arguments that are the values of the operands.

The convention of placing the operator to the left of the operands is known as prefix notation, and it may be somewhat confusing at first because it departs significantly from the customary mathematical convention. Prefix notation has several advantages, however. One of them is that it can accommodate procedures that may take an arbitrary number of arguments, as in the following examples:


```clojure
    > (* 2 3 4)
    2
```

```clojure
    > (/ 45 5 3)
    3
```

## Nesting
Prefix notation also extends in a straightforward way to allow combinations to be nested, that is, to have combinations whose elements are themselves combinations:

```clojure
> (+ (* 3 5) (- 10 6))
19
```


## Pretty Printing
Sometimes reading complex s-expressions can be made easier by lining them up

```clojure
(+ (* 3 (+ (* 2 4) (+ 3 5))) (+ (- 10 7) 6))
```

```clojure
(+ (* 3
      (+ (* 2 4)
         (+ 3 5)))
   (+ (- 10 7)
      6))
```
