# Compound Procedures

So far we have:

## Primitives
* Data (numbers, strings, keywords, chars)
* Procedures (arithmetic)

We can:
### Combine operations by nesting.
```clojure
(+ (* 3 5)
   (- (/ 4 3) (* 2 9)))
```

### Associate names with values.
```clojure
(def a 3)
(+ a 2)
```

Now we will learn how to make our own procedures, and learn our first model of how to evaluate them.

We can make a function that squares a number:

```clojure
(def square (fn [x]
              (* x x)))
```

There is a helper called `defn` that lets you create and name a function in one go

```clojure
(defn square [x]
  (* x x))
```

```
(defn <name> [<formal parameters>]
  <body>)
```

The `<name>` is a symbol to be associated with the procedure definition in the environment

The `<formal parameters>` are the names used within the body of the procedure to refer to the corresponding arguments of the procedure.

The `<body>` is an expression that will yield the value of the procedure application when the formal parameters are replaced by the actual arguments to which the procedure is applied.

Once we name it, we can of course use it

```clojure
> (square 21)
441
```

```clojure
> (square (+ 2 5))
49
```

```clojure
> (square (square 3))
81
```

You can also use functions without naming them, this will become useful later

```clojure
> ((fn [x] (* x x))
   2)
4
```
