# The Elements of Programming
A powerful programming language is more than just a means for instructing a computer to perform tasks. The language also serves as a framework within which we organize our ideas about processes. Thus, when we describe a language, we should pay particular attention to the means that the language provides for combining simple ideas to form more complex ideas.

Every powerful language has three mechanisms for accomplishing this:

* *primitive expressions*, which represent the simplest entities the language is concerned with,
* *means of combination*, by which compound elements are built from simpler ones, and
* *means of abstraction*, by which compound elements can be named and manipulated as units.

In programming, we deal with two kinds of elements: procedures and data. (Later we will discover that they are really not so distinct.) Informally, data is “stuff” that we want to manipulate, and procedures are descriptions of the rules for manipulating the data. Thus, any powerful programming language should be able to describe primitive data and primitive procedures and should have methods for combining and abstracting procedures and data.

In this chapter we will deal only with simple numerical data so that we can focus on the rules for building procedures. In later chapters we will see that these same rules allow us to build procedures to manipulate compound data as well. In this section we look at functions.

# The REPL
LISPs all have a so-called Read-Eval-Print-Loop where you type an expression and the interpreter responds by displaying the result of its evaluating that expression.

## Try Clojure
You can use [Try Clojure](http://www.tryclj.com/) to get a REPL (you may also like to do the intro there, start it by typing `next`)

## Leiningen
Leiningen is the easiest way to manage Clojure projects, it also provides a repl

Run `lein repl` from the commandline after you have [installed Leiningen](http://leiningen.org/)


# Primitive expressions

## Self-evaluating expressions
Some things simply evaluate to themselves:

### Numbers
```clojure
> 3
3
```

### Strings
```clojure
> "Hello"
"Hello"
```

### Keywords
```clojure
> :foo
:foo
```

### Booleans
```clojure
> true
true

> false
false
```

### Chars
```clojure
> \c
\c
```

### Unbound variables
If you try to lookup a name that does not exist then you get an error

```clojure
> undefined
CompilerException java.lang.RuntimeException:
  Unable to resolve symbol: undefined in this context
```

# Compound elements
```clojure
    > (+ 2 4)
    6
```

Expressions such as these, formed by delimiting a list of expressions within parentheses in order to denote procedure application, are called *combinations*. The leftmost element in the list is called the *operator*, and the other elements are called *operands*. The value of a combination is obtained by applying the procedure specified by the operator to the arguments that are the values of the operands.

The convention of placing the operator to the left of the operands is known as prefix notation, and it may be somewhat confusing at first because it departs significantly from the customary mathematical convention. Prefix notation has several advantages, however. One of them is that it can accommodate procedures that may take an arbitrary number of arguments, as in the following examples:


```clojure
    > (* 2 3 4)
    2
```

```clojure
    > (/ 45 5 3)
    3
```

## Nesting
Prefix notation also extends in a straightforward way to allow combinations to be nested, that is, to have combinations whose elements are themselves combinations:

```clojure
> (+ (* 3 5) (- 10 6))
19
```


## Pretty Printing
Sometimes reading complex s-expressions can be made easier by lining them up

```clojure
(+ (* 3 (+ (* 2 4) (+ 3 5))) (+ (- 10 7) 6))
```

```clojure
(+ (* 3
      (+ (* 2 4)
         (+ 3 5)))
   (+ (- 10 7)
      6))
```

# Naming Things
A critical aspect of a programming language is the means it provides for using names to refer to computational objects. We say that the name identifies a variable whose value is the object.

```clojure
    > (def a 2)
    #'user/a
```

Once we give something a name, we can refer to it in expressions

```clojure
    > (* a 3)
    6

    > (+ a a 3)
    7
```

`def` is Clojures simplest means of abstraction, for it allows us to use simple names to refer to the results of compound operations. In general, computational objects may have very complex structures, and it would be extremely inconvenient to have to remember and repeat their details each time we want to use them. Indeed, complex programs are constructed by building, step by step, computational objects of increasing complexity. The interpreter makes this step-by-step program construction particularly convenient because name-object associations can be created incrementally in successive interactions. This feature encourages the incremental development and testing of programs and is largely responsible for the fact that a Lisp program usually consists of a large number of relatively simple procedures.

It should be clear that the possibility of associating values with symbols and later retrieving them means that the interpreter must maintain some sort of memory that keeps track of the name-object pairs. This memory is called the environment (more precisely the global environment, since we will see later that a computation may involve a number of different environments).

# Evaluating Combinations
One of our goals in this chapter is to isolate issues about thinking procedurally.

In evaluating combinations, *the interpreter is itself following a procedure*

* Evaluate the subexpressions of the combination.
* Apply the procedure that is the value of the leftmost subexpression (the operator) to the arguments that are the values of the other subexpressions (the operands).
mark

Note that the first step says that in order to accomplish the evaluation process for a combination we must first perform the evaluation process on each element of the combination. Thus, the evaluation rule is *recursive* (it needs to invoke itself)

Have a look at the expression pretty printed below:

```clojure
(* (+ 2 (* 4 6))
   (+ 3 5 7))
```

Two things are being multiplied by `*`

`(+ 2 (* 4 6))`

and

`(+ 3 5 7)`

We have to evaluate both of them, in order to evaluate the first we need to evaluate `2` and `(* 4 6)`, which makes us have to recur again. You can think of the s-expressions as a tree with partial evaluations percolating upwards

<img src="/images/tree.png"/>

Note also that we are asked to evaluate primitive expressions, and:

* the values of numerals are the numbers that they name
* the values of built-in operators are the machine instruction sequences that carry out the corresponding operations
* the values of other names are the objects associated with those names in the environment.



## Special forms
Notice that the evaluation rule given above does not handle definitions. For instance, evaluating `(def x 3)` does not apply define to two arguments, one of which is the value of the symbol x and the other of which is 3

We will see more special forms soon, each has its own evaluation rule. The various kinds of expressions (each with its associated evaluation rule) constitute the *syntax* of the programming language.

In comparison with most other programming languages, Lisp has a very simple syntax.


# Predicates
```clojure
(= x y)
```

Returns true if:

* numbers in the same 'category', and numerically the same, where category is one of (integer or ratio), floating point, or BigDecimal.
* sequences, lists, vectors, or queues, with equal elements in the same order.
* sets, with equal elements, ignoring order.
* maps, with equal key/value pairs, ignoring order.
* symbols, or both keywords, with equal namespaces and names.
* refs, vars, or atoms, and they are the same object, i.e. (identical? x y) is true.
* the same type defined with deftype. The type's equiv method is called and its return value becomes the value of (= x y).
* other types, and Java's x.equals(y) is true. The result should be unsurprising for nil, booleans, characters, and strings.

# Numbers with coercion
```clojure
(== x y)
```
    > (= 2 2.0)
    false ; has different categories integer and floating point

    > (== 2 2.0)
    true

    > (== 5 5N (float 5.0) (double 5.0) (biginteger 5))
    true

    > (== Double/NaN Double/NaN)
    false ; Floating point spec says this

    > (== :foo)
    true

    > (== :foo :foo)
    ClassCastException clojure.lang.Keyword cannot be cast to java.lang.Number
    clojure.lang.Numbers.equiv (Numbers.java:206)

    > (== 2 "a")
    ClassCastException java.lang.String cannot be cast to java.lang.Number
    clojure.lang.Numbers.equiv (Numbers.java:206)

# and
    (and <e1> ... <en>)

    > (and (= 1 2) (/ 1 0))
    false

    > (and (= 1 1) (/ 1 0))
    ArithmeticException Divide by zero  clojure.lang.Numbers.divide (Numbers.java:156)

# or

    (or <e1> ... <en>)

    > (or (= 1 1) (/ 1 0))
    true

    > (or (= 0 1) :truthy)
    :truthy

# Not

    (not <e>)

False if <e> truthy, true if <e> false


# Conditional Expressions
## `if`
If expressions have the form

```
(if <predicate>
    <consequent>
    <alternative>)
```
The `<alternative>` clause is optional, nil is returned if the predicte is false and an alternative is not supplied.

```clojure
> (if (= (count "four")
         4)
      :predicate-was-true
      :predicate-was-false)
:predicate-was-true
```


```clojure
> (if (= (count "three")
         3)
      :no-consequent)
nil
```
## `cond`
`cond` expressions have the form

```
(cond <predicate1>
      <consequence1>

      ...

      <predicate_n>
      <consequence_n>

      :else
      <catchall>
      )
```
Here `:else` is just a normal symbol (hence is 'truthy')

```clojure
> (def x -12)

> (cond (> x 0)
        x

        (= x 0)
        0

        (< x 0)
        (- x))
12
```
```clojure
> (cond (< 0 x)
        "Negative"
        :else
        "Positive")
"Negative"
```

### In scheme
If you are reading along with SICP note that Scheme uses list structure to separate the clauses of cond and `else` is special.

Eg:

```scheme
(cond ((> x 0)
       x)
      ((= x 0)
       0)
      (else
       (- x)))
```


# So far:
We have:
### Primitives
* Data (numbers, strings, keywords, chars)
* Procedures (arithmetic)

We can:
### Combine operations by nesting.
```clojure
(+ (* 3 5)
   (- (/ 4 3) (* 2 9)))
```

### Associate names with values.
```clojure
(def a 3)
(+ a 2)
```

Now we will learn how to make our own procedures, and learn our first model of how to evaluate them.

# Compound Procedures
We can make a function that squares a number:

```clojure
(def square (fn [x]
              (* x x)))
```

There is a helper called `defn` that lets you create and name a function in one go

```clojure
(defn square [x]
  (* x x))
```

```
(defn <name> [<formal parameters>]
  <body>)
```

The `<name>` is a symbol to be associated with the procedure definition in the environment

The `<formal parameters>` are the names used within the body of the procedure to refer to the corresponding arguments of the procedure.

The `<body>` is an expression that will yield the value of the procedure application when the formal parameters are replaced by the actual arguments to which the procedure is applied.

Once we name it, we can of course use it

```clojure
> (square 21)
441
```

```clojure
> (square (+ 2 5))
49
```

```clojure
> (square (square 3))
81
```

You can also use functions without naming them, this will become useful later

```clojure
> ((fn [x] (* x x))
   2)
4
```

# The Substitution Model for Procedure Application
To apply a compound procedure to arguments, evaluate the body of the procedure with each formal parameter replaced by the corresponding argument.

```
(square 5)
```

Take the body of the procedure
```
(* x x)
```


Replace formal parameter (x) with the value of the arguement (5)
```
(* 5 5)
```

Evaluate
```
25
```
